## SQL AND SQLite

SQL(Structured Query Language ) is a standard language for meaning and manipulating relational databases. SQLite is a self-contained, serverless, and zero-configuration database engine that is widely used for embedded database system. In this lession, we will cover the basic of SQL and SQLite, including creating databases, tables, and performing various SQL operations.

In [1]:
import sqlite3

In [2]:
## Connect to an SQLite database 

conn=sqlite3.connect('example.db')

In [3]:
cursor=conn.cursor()

In [4]:
## Create a table
cursor.execute('''
CREATE TABLE IF NOT EXISTS employees (
    id INTEGER PRIMARY KEY,
    name TEXT NOT NULL,
    age INTEGER,
    department TEXT
)
''')

## Commit the changes
conn.commit()

In [5]:
cursor.execute('select * from employees')

In [56]:
# conn = sqlite3.connect("your_database_name.db", timeout=10)

In [6]:
## connect the database 
conn=sqlite3.connect('example.db')
cursor=conn.cursor()

In [7]:
## Insert some data  in sqlite table

cursor.execute('''
Insert Into employees(name,age,department) 
        values('rakesh',22,'scientist')
''')

# commit 
conn.commit()

In [17]:
# Quaring the data from table 
# cursor.execute('select * from employees')
# rows=cursor.fetchall()

# ## print the queried data 
# for row in rows :
#     print(row)

def show():
    cursor.execute('select * from employees')
    rows=cursor.fetchall()

    for row in rows:
        print(row)

show()

(2, 'Madhav', 100, 'manager')
(3, 'Raghav', 100, 'administrator ')

In [9]:


## Update the data in the table 

cursor.execute('''
Update employees set age=34 where name='rakesh'
''')
show()
conn.commit()

(1, 'rakesh', 34, 'scientist')

In [20]:
cursor.execute('''
Insert Into employees(name,age,department) 
        values('Madhav',43,'AI/ML')
''')

# commit 
conn.commit()

In [14]:
## Delete the date from the table 

cursor.execute('''
Delete from employees 
where age=34

''')

In [23]:
show()

(2, 'Madhav', 100, 'manager')
(3, 'Raghav', 100, 'administrator ')
(4, 'Madhav', 43, 'AI/ML')

In [22]:

cursor.execute('''
Delete from employees 
where name ='madhav'

''')

In [24]:
conn=sqlite3.connect('market.db')
cursor=conn.cursor()

In [25]:
## WOrking with sales Data 
cursor.execute('''
create table if not exists sales(
    id integer primary key,
    date text not null,
    product text not null,
    sales integer,
    region test
    
)
''')

In [26]:
sales_data=[
    ('2023-01-01','Product1',100,'north'),
    ('2023-01-02','Product2',100,'east'),
    ('2023-01-03','Product3',100,'south'),
    ('2023-01-04','Product4',100,'west'),
    ('2023-01-05','Product5',100,'east')

]

In [27]:
cursor.executemany('''
Insert into sales(data,product,sales,region) 
values (?,?,?,?)
''',sales_data)

conn.commit()

OperationalError: table sales has no column named data

In [28]:
print('hello')

hello